In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
outside=['G1','G1','G1','G2','G2','G2']

In [4]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [5]:
inside=[1,2,3,1,2,3]

In [6]:
inside

[1, 2, 3, 1, 2, 3]

In [7]:
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [8]:
df=pd.DataFrame(randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1  0.026850  0.275684
   2 -1.247031 -0.054967
   3  1.051560 -2.035326
G2 1 -1.097031 -0.376706
   2 -0.464607  0.252399
   3 -0.046526 -0.333381

In [9]:
df.index.names=('Groups','Names')

In [10]:
df

                     A         B
Groups Names
G1     1      0.026850  0.275684
       2     -1.247031 -0.054967
       3      1.051560 -2.035326
G2     1     -1.097031 -0.376706
       2     -0.464607  0.252399
       3     -0.046526 -0.333381

In [11]:
df.xs(1,level='Names')

               A         B
Groups
G1      0.026850  0.275684
G2     -1.097031 -0.376706

In [12]:
d={'A':[1,2,np.nan], 'B':[2,np.nan,np.nan],'C':[1,2,3]}

In [13]:
df=pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.dropna()

     A    B  C
0  1.0  2.0  1

In [16]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [18]:
df.dropna(thresh=1)

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [22]:
df=pd.DataFrame(data)

In [23]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [32]:
byComp=df.groupby('Company').sum().loc['GOOG']
byComp

Sales    320
Name: GOOG, dtype: int64

In [26]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [29]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [28]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [35]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340